app/Controllers/Ingreso.php

SELECT COUNT(*) AS `numrows`
FROM `persona`
WHERE `dni` = '48411441'
AND `pin` = '1111'
AND `activo` = 1
---
    public function signIn()
    {

        $dni = $this->request->getPost("dni");
        $pin = $this->request->getPost("pin");
        //		$model = $this->Signin_model->signIn($email, $pin);
        $db = db_connect();
        $datos = $db->table("persona");
        $num = $datos->where('dni', $dni)->where('pin',$pin)->where('activo',1)->countAllResults();